# Pràctica 2

**Autor:** Albert Moya

El repositori de la pràctica es pot visitar en el següent [enllaç](https://github.com/albertmoyanadal/ttad/tree/main/delivery).

In [5]:
import pandas as pd
import numpy as np
np.random.seed(42)

## Exercici 1

**Creación de DataFrames**

### Apartat a)

Crea un DataFrame `df1` con una columna llamada `numeros` que contenga los valores del 0 al 19.

In [6]:
df1 = pd.DataFrame({"numeros": range(20)})
df1

    numeros
0         0
1         1
2         2
3         3
4         4
5         5
6         6
7         7
8         8
9         9
10       10
11       11
12       12
13       13
14       14
15       15
16       16
17       17
18       18
19       19

### Apartat b)

Crea un DataFrame `df2` con una columna `aleatorios` de tamaño 10 con números aleatorios entre 0 y 1.

In [15]:
df2 = pd.DataFrame({"aleatorios": np.random.rand(10)}) # 0i 1 ja està per defecte
df2

   aleatorios
0    0.020584
1    0.969910
2    0.832443
3    0.212339
4    0.181825
5    0.183405
6    0.304242
7    0.524756
8    0.431945
9    0.291229

### Apartat c)

Combina los DataFrames anteriores `df1` y `df2` en un nuevo DataFrame llamado `df3`.

In [19]:
df3 = pd.concat([df1, df2], axis=1) # axis=1 vol dir que es concatena una columan davora l'altra
df3

    numeros  aleatorios
0         0    0.020584
1         1    0.969910
2         2    0.832443
3         3    0.212339
4         4    0.181825
5         5    0.183405
6         6    0.304242
7         7    0.524756
8         8    0.431945
9         9    0.291229
10       10         NaN
11       11         NaN
12       12         NaN
13       13         NaN
14       14         NaN
15       15         NaN
16       16         NaN
17       17         NaN
18       18         NaN
19       19         NaN

### Apartat d)

Guarda el DataFrame `df3` en un fichero `.csv`.

In [22]:
df3.to_csv("df3", index=False) # no guardaré l´índex

## Exercici 2

**Indexación y selección (10 pts)**

Dado el DataFrame:

```python
import pandas as pd
df = pd.DataFrame({
    "A": range(1, 11),
    "B": [5,3,6,8,2,9,1,7,4,10]
})

In [23]:
df = pd.DataFrame({
    "A": range(1, 11),
    "B": [5,3,6,8,2,9,1,7,4,10]
})

### Apartat a)

Selecciona las filas donde el valor de la columna `B` sea mayor que 5.

In [24]:
df[df['B'] > 5]

    A   B
2   3   6
3   4   8
5   6   9
7   8   7
9  10  10

### Apartat b)

Cambia los valores menores que 4 en la columna `B` a `NaN`. Para usar el valor `NaN` hay que utilizar `pd.NA`.

In [27]:
df[df['B'] < 4] = pd.NA
df

C:\Users\alber\AppData\Local\Temp\ipykernel_20996\1486302578.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['B'][df['B'] < 4] = pd.NA

      A     B
0   1.0   5.0
1   NaN   NaN
2   3.0   6.0
3   4.0   8.0
4   NaN   NaN
5   6.0   9.0
6   NaN   NaN
7   8.0   7.0
8   9.0   4.0
9  10.0  10.0

## Exercici 3

**Análisis de datos**

Descargad el conjunto de datos disponible en la página web y utilizad el fichero `winequality-red.csv`. Este dataset contiene información físico-química sobre diferentes vinos tintos de Portugal.

Se pide:

### Apartat a)

Obtén los estadísticos descriptivos más relevantes (`describe`) de cada columna. Explica brevemente qué mide cada una de ellas.

### Apartat b)

Convierte la columna `quality` en una columna categórica con tres categorías:

-  **bueno**
-  **regular**
-  **malo**

### Apartat c)

Selecciona los vinos clasificados como **malo** y elimínelos del DataFrame.

### Apartat d)

Convierte los valores de la columna `citric acid` a porcentajes.

### Apartat d)

Obtén los siete vinos con mayor valor de `pH`.

Ahora crea un fichero `.py` que defina las siguientes funciones:

### Apartat a)

`eliminaDecimales(df, col)`: recibe un DataFrame y el nombre de una columna, y crea una nueva columna llamada `<col>_sin_decimales` con el mismo valor pero truncado (sin decimales).

### Apartat b)

`calculaRatio(df, col1, col2)`: calcula el ratio entre dos columnas y genera una excepción si algún valor del ratio es mayor que 1.

Aplica la primera función a la columna `alcohol` y la segunda a las columnas `total sulfur dioxide` y `free sulfur dioxide`.

### Exercici 4

**Combinando información en pandas**

Dispones de los siguientes DataFrames:

```python
import pandas as pd

estudiantes = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "nombre": ["Ana", "Luis", "Marta", "Jorge"]
})

notas = pd.DataFrame({
    "id": [1, 2, 2, 5],
    "asignatura": ["Matemáticas", "Historia", "Química", "Biología"],
    "nota": [8.5, 7.0, 6.5, 9.0]
})
```

Realiza las siguientes tareas:

### Apartat a)

Realiza un **merge interno** (`inner`) entre ambos DataFrames. ¿Cuántas filas se obtienen? ¿Por qué?

### Apartat b)

Realiza un **merge externo** (`outer`). Explica las filas que aparecen con valores nulos.

### Apartat c)

Realiza un **left merge** usando `estudiantes` como tabla izquierda. ¿Qué información se pierde respecto al `outer`?

### Apartat d)

Realiza un **right merge** usando `notas` como tabla derecha. ¿Qué estudiantes desaparecen en el resultado?

### Apartat e)

Añade una columna llamada `curso` al DataFrame `estudiantes`. Después, combina los datos utilizando un merge múltiple por `id` y explica el resultado.

## Exercici 5

**Agregaciones y operaciones con `groupby`**

Se trabajará con un conjunto de datos sobre ventas realizadas por una empresa en distintas regiones.

```python
import pandas as pd

ventas = pd.DataFrame({
    "region": ["Norte","Norte","Sur","Este","Sur","Este","Oeste",
               "Oeste","Norte","Sur"],
    "vendedor": ["Ana","Luis","Ana","Jorge","Luis","Ana","Marta",
                 "Luis","Ana","Jorge"],
    "ventas": [1200, 800, 950, 1100, 400, 1600, 700, 450, 895, 900],
    "producto": ["A","A","B","A","B","A","B","A","B","B"]
})
```

Realiza las siguientes tareas:

### Apartat a)

Obtén el total de ventas por región.

### Apartat b)

Calcula la media, el valor máximo y el mínimo de las ventas agrupadas por vendedor.

### Apartat c)

Calcula el número de ventas realizadas por cada combinación de `region` y `producto`.

### Apartat d)

Crea una función llamada `rango_ventas` en un fichero `.py` que calcule la diferencia entre el valor máximo y mínimo de un grupo. Aplícala a las ventas agrupando por región.

### Apartat e)

Identifica la región con el mayor número total de ventas y muestra solo esa región.

## Exercici 6

**Gestión de datos ausentes**

Después de la clase del día 18/11/2025 se añadirá el enunciado de este ejercicio.